geosmall/Arduino_Core_STM32/libraries/DShot/src/DShot_ll.cpp
#include <Arduino.h>
#include "DShot_ll.h"
#include "PeripheralPins.h"
#include "timer.h"
#include "pinmap.h"
#include "dma.h"

namespace DShot {

// ---------------------------------------------------------------------------
// Timer clock frequency
// ---------------------------------------------------------------------------
uint32_t getTimerClockFreq(TIM_TypeDef *timer)
{
  uint32_t timer_clock = 0;
  uint8_t clkSrc = getTimerClkSrc(timer);

  if (clkSrc == 2) {
    // APB2 timer
    timer_clock = HAL_RCC_GetPCLK2Freq();
#if defined(STM32H7xx)
    if ((RCC->D2CFGR & RCC_D2CFGR_D2PPRE2) != 0) {
      timer_clock *= 2;
    }
#else
    if ((RCC->CFGR & RCC_CFGR_PPRE2) != 0) {
      timer_clock *= 2;
    }
#endif
  } else {
    // APB1 timer
    timer_clock = HAL_RCC_GetPCLK1Freq();
#if defined(STM32H7xx)
    if ((RCC->D2CFGR & RCC_D2CFGR_D2PPRE1) != 0) {
      timer_clock *= 2;
    }
#else
    if ((RCC->CFGR & RCC_CFGR_PPRE1) != 0) {
      timer_clock *= 2;
    }
#endif
  }

  return timer_clock;
}

// ---------------------------------------------------------------------------
// Enable timer peripheral clock
// ---------------------------------------------------------------------------
void enableTimerClk(TIM_TypeDef *timer)
{
  // Use a temporary HAL handle to leverage the core's enableTimerClock()
  TIM_HandleTypeDef htim;
  htim.Instance = timer;
  enableTimerClock(&htim);
}

// ---------------------------------------------------------------------------
// Enable DMA controller clock
// ---------------------------------------------------------------------------
void enableDMAClk(DMA_TypeDef *dma)
{
#if defined(DMA1)
  if (dma == DMA1) {
    __HAL_RCC_DMA1_CLK_ENABLE();
  }
#endif
#if defined(DMA2)
  if (dma == DMA2) {
    __HAL_RCC_DMA2_CLK_ENABLE();
  }
#endif
#if defined(__HAL_RCC_DMAMUX1_CLK_ENABLE)
  // G4/H7: DMAMUX has a separate clock gate
  __HAL_RCC_DMAMUX1_CLK_ENABLE();
#endif
}

// ---------------------------------------------------------------------------
// GPIO init — configure pin AF for timer output
// ---------------------------------------------------------------------------
void initGPIO(uint32_t pin, TIM_TypeDef *timer, uint32_t ll_channel)
{
  PinName pin_name = digitalPinToPinName(pin);

  // Find the PinMap_TIM entry matching both this physical pin AND the
  // specified timer.  pinmap_function() returns the first pin match, which
  // is wrong when a pin has multiple timer functions listed under ALT names
  // (e.g., PB0: TIM1_CH2N at AF1, TIM3_CH3 at AF2 via PB_0_ALT1).
  uint32_t function = 0;
  const PinMap *map = PinMap_TIM;
  while (map->pin != NC) {
    if (map->peripheral == timer &&
        STM_PORT(map->pin) == STM_PORT(pin_name) &&
        STM_PIN(map->pin) == STM_PIN(pin_name)) {
      function = map->function;
      break;
    }
    map++;
  }
  if (function == 0) {
    // Fallback: first pin match (original behavior)
    function = pinmap_function(pin_name, PinMap_TIM);
  }

  // Configure the pin: sets GPIO mode to AF, assigns the correct AF number
  pin_function(pin_name, function);

  // Set output speed to high for better signal integrity
  GPIO_TypeDef *port = get_GPIO_Port(STM_PORT(pin_name));
  LL_GPIO_SetPinSpeed(port, STM_LL_GPIO_PIN(pin_name), LL_GPIO_SPEED_FREQ_HIGH);
}

// ---------------------------------------------------------------------------
// Timer init — prescaler, ARR, PWM1 mode, output compare
// ---------------------------------------------------------------------------
void initTimer(TIM_TypeDef *timer, uint32_t ll_channel, Speed speed)
{
  enableTimerClk(timer);
  LL_TIM_DisableCounter(timer);

  // Time base
  LL_TIM_InitTypeDef tim_init;
  LL_TIM_StructInit(&tim_init);

  uint32_t tim_clk = getTimerClockFreq(timer);
  tim_init.Prescaler = (uint16_t)((tim_clk / (uint32_t)speed) - 1);
  tim_init.Autoreload = BIT_PERIOD;
  tim_init.ClockDivision = LL_TIM_CLOCKDIVISION_DIV1;
  tim_init.RepetitionCounter = 0;
  tim_init.CounterMode = LL_TIM_COUNTERMODE_UP;

  LL_TIM_Init(timer, &tim_init);

  // Output compare — configured per-channel by the caller after this
  // (initTimer is called once per timer group, OC init per channel)

  LL_TIM_EnableARRPreload(timer);
}

// Helper: init one OC channel on an already-initialized timer
static void initOC(TIM_TypeDef *timer, uint32_t ll_channel)
{
  LL_TIM_OC_InitTypeDef oc_init;
  LL_TIM_OC_StructInit(&oc_init);

  oc_init.OCMode = LL_TIM_OCMODE_PWM1;
  oc_init.OCState = LL_TIM_OCSTATE_ENABLE;
  oc_init.OCIdleState = LL_TIM_OCIDLESTATE_LOW;
  oc_init.OCPolarity = LL_TIM_OCPOLARITY_HIGH;
  oc_init.CompareValue = 0;

  LL_TIM_OC_Init(timer, ll_channel, &oc_init);
  LL_TIM_OC_EnablePreload(timer, ll_channel);
  LL_TIM_CC_EnableChannel(timer, ll_channel);
}

// ---------------------------------------------------------------------------
// DMA resource resolution — family-specific
// ---------------------------------------------------------------------------

#if defined(STM32F4xx) || defined(STM32F7xx)

// F4/F7: Fixed stream↔peripheral mapping from reference manuals
// Table: {timer, channel_index, DMA, stream, channel_select}
//
// F411 DMA streams shared with UART RX (claimed by uart.c via dma_set_handler):
//   DMA1_Stream5 — USART2_RX (also TIM3_CH2, but DShot skips via claim check)
//   DMA2_Stream1 — USART6_RX (also TIM1_CH1 alt, not in table)
//   DMA2_Stream2 — USART1_RX (also TIM1_CH2 alt, not in table)
// These streams are NOT excluded from the table. Instead, dma_is_claimed()
// detects conflicts at init time and auto-upgrades to DMAR burst if needed.
// See initAllDMA() in DShotOutput.cpp for the resolve → decide → claim flow.
struct DMAMapping {
  TIM_TypeDef *timer;
  uint8_t ch_index;      // 0=CH1, 1=CH2, 2=CH3, 3=CH4
  DMA_TypeDef *dma;
  uint32_t stream;
  uint32_t channel_sel;
};

static const DMAMapping dma_map[] = {
  // TIM1
  {TIM1, 0, DMA2, LL_DMA_STREAM_6, LL_DMA_CHANNEL_0},  // TIM1_CH1
  {TIM1, 1, DMA2, LL_DMA_STREAM_6, LL_DMA_CHANNEL_0},  // TIM1_CH2 (alt: stream 2)
  {TIM1, 2, DMA2, LL_DMA_STREAM_6, LL_DMA_CHANNEL_6},  // TIM1_CH3
  {TIM1, 3, DMA2, LL_DMA_STREAM_4, LL_DMA_CHANNEL_6},  // TIM1_CH4
  // TIM3
  {TIM3, 0, DMA1, LL_DMA_STREAM_4, LL_DMA_CHANNEL_5},  // TIM3_CH1
  {TIM3, 1, DMA1, LL_DMA_STREAM_5, LL_DMA_CHANNEL_5},  // TIM3_CH2
  {TIM3, 2, DMA1, LL_DMA_STREAM_7, LL_DMA_CHANNEL_5},  // TIM3_CH3
  {TIM3, 3, DMA1, LL_DMA_STREAM_2, LL_DMA_CHANNEL_5},  // TIM3_CH4
  // TIM4
  {TIM4, 0, DMA1, LL_DMA_STREAM_0, LL_DMA_CHANNEL_2},  // TIM4_CH1
  {TIM4, 1, DMA1, LL_DMA_STREAM_3, LL_DMA_CHANNEL_2},  // TIM4_CH2
  {TIM4, 2, DMA1, LL_DMA_STREAM_7, LL_DMA_CHANNEL_2},  // TIM4_CH3
  // TIM5
  {TIM5, 0, DMA1, LL_DMA_STREAM_2, LL_DMA_CHANNEL_6},  // TIM5_CH1
  {TIM5, 1, DMA1, LL_DMA_STREAM_4, LL_DMA_CHANNEL_6},  // TIM5_CH2
  {TIM5, 2, DMA1, LL_DMA_STREAM_0, LL_DMA_CHANNEL_6},  // TIM5_CH3
  {TIM5, 3, DMA1, LL_DMA_STREAM_1, LL_DMA_CHANNEL_6},  // TIM5_CH4
#if defined(TIM8_BASE)
  // TIM8
  {TIM8, 0, DMA2, LL_DMA_STREAM_2, LL_DMA_CHANNEL_7},  // TIM8_CH1
  {TIM8, 1, DMA2, LL_DMA_STREAM_3, LL_DMA_CHANNEL_7},  // TIM8_CH2
  {TIM8, 2, DMA2, LL_DMA_STREAM_4, LL_DMA_CHANNEL_7},  // TIM8_CH3
  {TIM8, 3, DMA2, LL_DMA_STREAM_7, LL_DMA_CHANNEL_7},  // TIM8_CH4
#endif
};

