geosmall/Arduino_Core_STM32/libraries/DShot/src/DShot_ll.cpp
bool resolveDMA(MotorHW *motor)
{
  for (size_t i = 0; i < sizeof(dma_map) / sizeof(dma_map[0]); i++) {
    if (dma_map[i].timer == motor->timer &&
        dma_map[i].ch_index == motor->channel_index) {
      motor->dma = dma_map[i].dma;
      motor->dma_stream = dma_map[i].stream;
      motor->dma_channel_sel = dma_map[i].channel_sel;
      return true;
    }
  }
  return false;
}

#elif defined(STM32G4xx) || defined(STM32H7xx)

// G4/H7: DMAMUX allows flexible routing — scan for first unclaimed stream

// DMAMUX request lookup table — same pattern as dma_map[] above for F4/F7
struct DMAMUXMapping {
  TIM_TypeDef *timer;
  uint8_t ch_index;      // 0=CH1, 1=CH2, 2=CH3, 3=CH4
  uint32_t request_id;
};

#if defined(STM32H7xx)
static const DMAMUXMapping dmamux_map[] = {
#if defined(TIM1_BASE)
  {TIM1, 0, LL_DMAMUX1_REQ_TIM1_CH1}, {TIM1, 1, LL_DMAMUX1_REQ_TIM1_CH2},
  {TIM1, 2, LL_DMAMUX1_REQ_TIM1_CH3}, {TIM1, 3, LL_DMAMUX1_REQ_TIM1_CH4},
#endif
#if defined(TIM3_BASE)
  {TIM3, 0, LL_DMAMUX1_REQ_TIM3_CH1}, {TIM3, 1, LL_DMAMUX1_REQ_TIM3_CH2},
  {TIM3, 2, LL_DMAMUX1_REQ_TIM3_CH3}, {TIM3, 3, LL_DMAMUX1_REQ_TIM3_CH4},
#endif
#if defined(TIM4_BASE)
  {TIM4, 0, LL_DMAMUX1_REQ_TIM4_CH1}, {TIM4, 1, LL_DMAMUX1_REQ_TIM4_CH2},
  {TIM4, 2, LL_DMAMUX1_REQ_TIM4_CH3},  // TIM4_CH4 not available on some H7
#endif
#if defined(TIM5_BASE)
  {TIM5, 0, LL_DMAMUX1_REQ_TIM5_CH1}, {TIM5, 1, LL_DMAMUX1_REQ_TIM5_CH2},
  {TIM5, 2, LL_DMAMUX1_REQ_TIM5_CH3}, {TIM5, 3, LL_DMAMUX1_REQ_TIM5_CH4},
#endif
#if defined(TIM8_BASE)
  {TIM8, 0, LL_DMAMUX1_REQ_TIM8_CH1}, {TIM8, 1, LL_DMAMUX1_REQ_TIM8_CH2},
  {TIM8, 2, LL_DMAMUX1_REQ_TIM8_CH3}, {TIM8, 3, LL_DMAMUX1_REQ_TIM8_CH4},
#endif
};
#elif defined(STM32G4xx)
static const DMAMUXMapping dmamux_map[] = {
#if defined(TIM1_BASE)
  {TIM1, 0, LL_DMAMUX_REQ_TIM1_CH1}, {TIM1, 1, LL_DMAMUX_REQ_TIM1_CH2},
  {TIM1, 2, LL_DMAMUX_REQ_TIM1_CH3}, {TIM1, 3, LL_DMAMUX_REQ_TIM1_CH4},
#endif
#if defined(TIM3_BASE)
  {TIM3, 0, LL_DMAMUX_REQ_TIM3_CH1}, {TIM3, 1, LL_DMAMUX_REQ_TIM3_CH2},
  {TIM3, 2, LL_DMAMUX_REQ_TIM3_CH3}, {TIM3, 3, LL_DMAMUX_REQ_TIM3_CH4},
#endif
#if defined(TIM4_BASE)
  {TIM4, 0, LL_DMAMUX_REQ_TIM4_CH1}, {TIM4, 1, LL_DMAMUX_REQ_TIM4_CH2},
  {TIM4, 2, LL_DMAMUX_REQ_TIM4_CH3}, {TIM4, 3, LL_DMAMUX_REQ_TIM4_CH4},
#endif
#if defined(TIM8_BASE)
  {TIM8, 0, LL_DMAMUX_REQ_TIM8_CH1}, {TIM8, 1, LL_DMAMUX_REQ_TIM8_CH2},
  {TIM8, 2, LL_DMAMUX_REQ_TIM8_CH3}, {TIM8, 3, LL_DMAMUX_REQ_TIM8_CH4},
#endif
#if defined(TIM16_BASE)
  {TIM16, 0, LL_DMAMUX_REQ_TIM16_CH1},
#endif
};
#endif

static uint32_t getDMAMUXRequest(TIM_TypeDef *timer, uint8_t ch_index)
{
  for (size_t i = 0; i < sizeof(dmamux_map) / sizeof(dmamux_map[0]); i++) {
    if (dmamux_map[i].timer == timer && dmamux_map[i].ch_index == ch_index)
      return dmamux_map[i].request_id;
  }
  return 0;
}

bool resolveDMA(MotorHW *motor)
{
  uint32_t dmamux_req = getDMAMUXRequest(motor->timer, motor->channel_index);
  if (dmamux_req == 0) return false;

  // Scan for the first unclaimed stream/channel across DMA1, then DMA2.
  // Skips streams already claimed by UART or other DMA consumers.
  DMA_TypeDef *controllers[] = { DMA1
#if defined(DMA2)
    , DMA2
#endif
  };
  for (size_t c = 0; c < sizeof(controllers) / sizeof(controllers[0]); c++) {
    for (uint32_t s = 0; s < 8; s++) {
      if (!dma_is_claimed(controllers[c], s)) {
        motor->dma = controllers[c];
        motor->dma_stream = s;
        // DMAMUX configuration is done in initDMA()
        return true;
      }
    }
  }
  return false;  // all streams/channels exhausted
}

#endif // family selection

// ---------------------------------------------------------------------------
// DMA initialization
// ---------------------------------------------------------------------------
void initDMA(MotorHW *motor)
{
  enableDMAClk(motor->dma);

  // Get the CCR address for this channel
  volatile uint32_t *ccr_addr;
  switch (motor->channel_index) {
    case 0: ccr_addr = &motor->timer->CCR1; break;
    case 1: ccr_addr = &motor->timer->CCR2; break;
    case 2: ccr_addr = &motor->timer->CCR3; break;
    case 3: ccr_addr = &motor->timer->CCR4; break;
    default: return;
  }

#if defined(STM32F4xx) || defined(STM32F7xx)
  // F4/F7: Stream-based DMA with fixed channel selection

  LL_DMA_DisableStream(motor->dma, motor->dma_stream);
  LL_DMA_DeInit(motor->dma, motor->dma_stream);

  LL_DMA_InitTypeDef dma_init;
  LL_DMA_StructInit(&dma_init);

  dma_init.Channel = motor->dma_channel_sel;
  dma_init.MemoryOrM2MDstAddress = (uint32_t)motor->dma_buffer;
  dma_init.PeriphOrM2MSrcAddress = (uint32_t)ccr_addr;
  dma_init.Direction = LL_DMA_DIRECTION_MEMORY_TO_PERIPH;
  dma_init.NbData = DMA_BUF_SIZE;
  dma_init.PeriphOrM2MSrcIncMode = LL_DMA_PERIPH_NOINCREMENT;
  dma_init.MemoryOrM2MDstIncMode = LL_DMA_MEMORY_INCREMENT;
  dma_init.PeriphOrM2MSrcDataSize = LL_DMA_PDATAALIGN_WORD;
  dma_init.MemoryOrM2MDstDataSize = LL_DMA_MDATAALIGN_WORD;
  dma_init.Mode = LL_DMA_MODE_NORMAL;
  dma_init.Priority = LL_DMA_PRIORITY_HIGH;
  dma_init.FIFOMode = LL_DMA_FIFOMODE_ENABLE;
  dma_init.FIFOThreshold = LL_DMA_FIFOTHRESHOLD_1_4;
  dma_init.MemBurst = LL_DMA_MBURST_SINGLE;
  dma_init.PeriphBurst = LL_DMA_PBURST_SINGLE;

  LL_DMA_Init(motor->dma, motor->dma_stream, &dma_init);

#elif defined(STM32H7xx)
  // H7: Stream-based DMA with DMAMUX

  LL_DMA_DisableStream(motor->dma, motor->dma_stream);
  LL_DMA_DeInit(motor->dma, motor->dma_stream);

  LL_DMA_InitTypeDef dma_init;
  LL_DMA_StructInit(&dma_init);

  dma_init.PeriphRequest = getDMAMUXRequest(motor->timer, motor->channel_index);
  dma_init.MemoryOrM2MDstAddress = (uint32_t)motor->dma_buffer;
  dma_init.PeriphOrM2MSrcAddress = (uint32_t)ccr_addr;
  dma_init.Direction = LL_DMA_DIRECTION_MEMORY_TO_PERIPH;
  dma_init.NbData = DMA_BUF_SIZE;
  dma_init.PeriphOrM2MSrcIncMode = LL_DMA_PERIPH_NOINCREMENT;
  dma_init.MemoryOrM2MDstIncMode = LL_DMA_MEMORY_INCREMENT;
  dma_init.PeriphOrM2MSrcDataSize = LL_DMA_PDATAALIGN_WORD;
  dma_init.MemoryOrM2MDstDataSize = LL_DMA_MDATAALIGN_WORD;
  dma_init.Mode = LL_DMA_MODE_NORMAL;
  dma_init.Priority = LL_DMA_PRIORITY_HIGH;
  dma_init.FIFOMode = LL_DMA_FIFOMODE_DISABLE;
  dma_init.PeriphBurst = LL_DMA_PBURST_SINGLE;
  dma_init.MemBurst = LL_DMA_MBURST_SINGLE;

