geosmall/Arduino_Core_STM32/libraries/DShot/src/DShot_ll.cpp
  LL_DMA_Init(motor->dma, motor->dma_stream, &dma_init);

#elif defined(STM32G4xx)
  // G4: Channel-based DMA with DMAMUX

  LL_DMA_DisableChannel(motor->dma, motor->dma_stream);
  LL_DMA_DeInit(motor->dma, motor->dma_stream);

  LL_DMA_InitTypeDef dma_init;
  LL_DMA_StructInit(&dma_init);

  dma_init.PeriphRequest = getDMAMUXRequest(motor->timer, motor->channel_index);
  dma_init.MemoryOrM2MDstAddress = (uint32_t)motor->dma_buffer;
  dma_init.PeriphOrM2MSrcAddress = (uint32_t)ccr_addr;
  dma_init.Direction = LL_DMA_DIRECTION_MEMORY_TO_PERIPH;
  dma_init.NbData = DMA_BUF_SIZE;
  dma_init.PeriphOrM2MSrcIncMode = LL_DMA_PERIPH_NOINCREMENT;
  dma_init.MemoryOrM2MDstIncMode = LL_DMA_MEMORY_INCREMENT;
  dma_init.PeriphOrM2MSrcDataSize = LL_DMA_PDATAALIGN_WORD;
  dma_init.MemoryOrM2MDstDataSize = LL_DMA_MDATAALIGN_WORD;
  dma_init.Mode = LL_DMA_MODE_NORMAL;
  dma_init.Priority = LL_DMA_PRIORITY_HIGH;

  LL_DMA_Init(motor->dma, motor->dma_stream, &dma_init);
#endif

  // No DMA TC interrupts — completion is handled by cleanup-at-start-of-Send().
  // Normal-mode DMA auto-disables the stream/channel on transfer completion.
  // This avoids IRQ handler conflicts with uart.c strong handlers on F4.
}

// ---------------------------------------------------------------------------
// Timer DMA request enable/disable helpers
// ---------------------------------------------------------------------------
static void enableTimDMAReq(TIM_TypeDef *timer, uint8_t ch_index)
{
  switch (ch_index) {
    case 0: LL_TIM_EnableDMAReq_CC1(timer); break;
    case 1: LL_TIM_EnableDMAReq_CC2(timer); break;
    case 2: LL_TIM_EnableDMAReq_CC3(timer); break;
    case 3: LL_TIM_EnableDMAReq_CC4(timer); break;
  }
}

static void disableTimDMAReq(TIM_TypeDef *timer, uint8_t ch_index)
{
  switch (ch_index) {
    case 0: LL_TIM_DisableDMAReq_CC1(timer); break;
    case 1: LL_TIM_DisableDMAReq_CC2(timer); break;
    case 2: LL_TIM_DisableDMAReq_CC3(timer); break;
    case 3: LL_TIM_DisableDMAReq_CC4(timer); break;
  }
}

// ---------------------------------------------------------------------------
// DMA flag clearing — family-specific
// ---------------------------------------------------------------------------
static void clearDMAFlags(DMA_TypeDef *dma, uint32_t stream_or_channel)
{
#if defined(STM32G4xx)
  // G4: channel-based. GI clear bit at position (4 * ch) clears all flags.
  // Channels 1-8 are LL values 0-7; CGIF positions: 0, 4, 8, ..., 28.
  WRITE_REG(dma->IFCR, 0xFU << (4U * stream_or_channel));
#else
  // F4/F7/H7: stream-based. TC bit positions are non-uniform within each
  // half-register: {5, 11, 21, 27} for streams {0,1,2,3} and {4,5,6,7}.
  static const uint8_t tc_pos[] = {5, 11, 21, 27};
  volatile uint32_t *reg = (stream_or_channel < 4) ? &dma->LIFCR : &dma->HIFCR;
  WRITE_REG(*reg, 1UL << tc_pos[stream_or_channel & 3]);
#endif
}

// ---------------------------------------------------------------------------
// Cleanup from previous DMA transfer
// ---------------------------------------------------------------------------
void cleanupPreviousTransfer(MotorHW *motor)
{
  // Disable timer DMA request (may still be enabled from previous cycle)
  disableTimDMAReq(motor->timer, motor->channel_index);

  // Explicitly disable DMA before clearing flags and re-arming.
  // Normal mode auto-disables on completion, but explicit disable ensures
  // clean state for re-arm on all families (required on G4).
#if defined(STM32G4xx)
  LL_DMA_DisableChannel(motor->dma, motor->dma_stream);
#else
  LL_DMA_DisableStream(motor->dma, motor->dma_stream);
#endif

  // Clear DMA event flags (required before re-enabling stream/channel)
  clearDMAFlags(motor->dma, motor->dma_stream);
}

// ---------------------------------------------------------------------------
// Trigger DMA transfer
// ---------------------------------------------------------------------------
void triggerDMA(MotorHW *motor)
{
#if defined(__DCACHE_PRESENT) && (__DCACHE_PRESENT == 1U)
  // Flush DCache to ensure DMA reads current buffer contents (H7, some F7)
  SCB_CleanDCache_by_Addr(motor->dma_buffer, sizeof(motor->dma_buffer));
#endif

#if defined(STM32G4xx)
  LL_DMA_SetDataLength(motor->dma, motor->dma_stream, DMA_BUF_SIZE);
  LL_DMA_EnableChannel(motor->dma, motor->dma_stream);
#else
  // F4/F7/H7: stream-based
  LL_DMA_SetDataLength(motor->dma, motor->dma_stream, DMA_BUF_SIZE);
  LL_DMA_EnableStream(motor->dma, motor->dma_stream);
#endif

  enableTimDMAReq(motor->timer, motor->channel_index);
}

// ---------------------------------------------------------------------------
// Transfer complete check — polls hardware
// ---------------------------------------------------------------------------
bool allTransfersComplete(const MotorHW *motors, int count)
{
  // In normal mode, DMA auto-disables the stream/channel on transfer completion.
  // A disabled stream/channel means the transfer is done (or was never started).
  for (int i = 0; i < count; i++) {
#if defined(STM32G4xx)
    if (LL_DMA_IsEnabledChannel(motors[i].dma, motors[i].dma_stream))
      return false;
#else
    if (LL_DMA_IsEnabledStream(motors[i].dma, motors[i].dma_stream))
      return false;
#endif
  }
  return true;
}

// ---------------------------------------------------------------------------
// DMAR burst mode — all families
// ---------------------------------------------------------------------------

void fillDmaBurstBuffer(uint32_t *burst_buffer, uint8_t ch_index,
                        uint8_t burst_length, uint16_t packet)
{
  for (int i = 0; i < 16; i++) {
    burst_buffer[ch_index + i * burst_length] =
        (packet & 0x8000) ? BIT_1_DUTY : BIT_0_DUTY;
    packet <<= 1;
  }
  // Reset frame (2 zero bits)
  burst_buffer[ch_index + 16 * burst_length] = 0;
  burst_buffer[ch_index + 17 * burst_length] = 0;
}

// Convert burst_length (1-4) to LL_TIM_DMABURST_LENGTH_xTRANSFERS enum
static uint32_t burstLengthToLL(uint8_t length)
{
  switch (length) {
    case 1:  return LL_TIM_DMABURST_LENGTH_1TRANSFER;
    case 2:  return LL_TIM_DMABURST_LENGTH_2TRANSFERS;
    case 3:  return LL_TIM_DMABURST_LENGTH_3TRANSFERS;
    default: return LL_TIM_DMABURST_LENGTH_4TRANSFERS;
  }
}

bool resolveDMABurst(BurstGroup *group)
{
#if defined(STM32F4xx) || defined(STM32F7xx)
  // Look up the trigger channel's DMA stream from the fixed F4/F7 map
  for (size_t i = 0; i < sizeof(dma_map) / sizeof(dma_map[0]); i++) {
    if (dma_map[i].timer == group->timer &&
        dma_map[i].ch_index == group->trigger_ch_index) {
      group->dma = dma_map[i].dma;
      group->dma_stream = dma_map[i].stream;
      group->dma_channel_sel = dma_map[i].channel_sel;
      return true;
    }
  }
  return false;

